export const tableData = [
  {
    id: "1",
    consumer: "Ягуберный Владимир Владимирович",
    performer: "ООО Панаев",
    nature: "Некачественный товар (ст. 20)",
    disputeArea: "Купля-продажа некачественного товара",
    responsible: "Добросельский Никита Андреевич",
    status: "Ведется работа по делу",
    dateAdded: "10.04.2025",
    notes: "12"
  },
  {
    id: "2",
    consumer: "Паскудников Игорь Васильевич",
    performer: "ГП ЖЭУ № 3 Центрального района г. Минска",
    nature: "Некачественная услуга (ст. 31)",
    disputeArea: "Услуги ЖКХ",
    responsible: "Романович Алексей Дмитриевич",
    status: "В архиве",
    dateAdded: "10.04.2025",
    notes: "45"
  },
  {
    id: "3",
    consumer: "Ковалева Анна Сергеевна",
    performer: "ИООО Дана Астра",
    nature: "Нарушение сроков доставки (ст. 23)",
    disputeArea: "Дистанционная торговля",
    responsible: "Добросельский Никита Андреевич",
    status: "Ведется работа по делу",
    dateAdded: "11.04.2025",
    notes: "78"
  },
  {
    id: "4",
    consumer: "Петровский Дмитрий Игоревич",
    performer: "ООО АвтоМир",
    nature: "Некачественная услуга (ст. 31)",
    disputeArea: "Долевое строительство",
    responsible: "Романович Алексей Дмитриевич",
    status: "Ведется работа по делу",
    dateAdded: "12.04.2025",
    notes: "23"
  },
  {
    id: "5",
    consumer: "Семенова Елена Викторовна",
    performer: "ООО ТурПлюс",
    nature: "Нарушение сроков оказания услуги (ст. 30)",
    disputeArea: "Туристические услуги",
    responsible: "Добросельский Никита Андреевич",
    status: "В архиве",
    dateAdded: "13.04.2025",
    notes: "56"
  },
  {
    id: "6",
    consumer: "Григорьев Артем Олегович",
    performer: "ООО ТехноГарант",
    nature: "Односторонний отказ от услуги (ст. 38-1)",
    disputeArea: "Бытовая техника",
    responsible: "Романович Алексей Дмитриевич",
    status: "Ведется работа по делу",
    dateAdded: "13.04.2025",
    notes: "89"
  },
  {
    id: "7",
    consumer: "Васнецова Ольга Николаевна",
    performer: "ООО СтройДом",
    nature: "Некачественный товар (ст. 20)",
    disputeArea: "Купля-продажа непродовольственного товара",
    responsible: "Добросельский Никита Андреевич",
    status: "Ведется работа по делу",
    dateAdded: "13.04.2025",
    notes: "34"
  },
  {
    id: "8",
    consumer: "Морозов Иван Петрович",
    performer: "ООО МедикалСервис",
    nature: "Некачественная услуга (ст. 31)",
    disputeArea: "Медицинские услуги",
    responsible: "Романович Алексей Дмитриевич",
    status: "В архиве",
    dateAdded: "13.04.2025",
    notes: "67"
  },
  {
    id: "9",
    consumer: "Зайцева Татьяна Владимировна",
    performer: "ООО КредитФинанс",
    nature: "Навязанная услуга (ст. 16)",
    disputeArea: "Финансовые услуги",
    responsible: "Добросельский Никита Андреевич",
    status: "Вынесено судебное решение (определение)",
    dateAdded: "14.04.2025",
    notes: "5"
  },
  {
    id: "10",
    consumer: "Козлов Сергей Александрович",
    performer: "ИП Иванова М.П.",
    nature: "Некачественная услуга (ст. 31)",
    disputeArea: "Прочие споры",
    responsible: "Романович Алексей Дмитриевич",
    status: "Новое",
    dateAdded: "14.04.2025",
    notes: "92"
  }
];

export const claimsData = [
  {
    number: "123",
    date: "15.10.2023",
    seller: "ООО 'ТехноГарант'",
    consumer: "Иванов Иван Иванович",
    reason: "Некачественный товар (ст. 20 Закона о защите прав потребителей)",
    demand: "Замена товара на аналогичный",
    responsible: "Петрова Мария Сергеевна",
    status: "В обработке"
  },
  {
    number: "23",
    date: "16.10.2023",
    seller: "ИП Сидоров А.А.",
    consumer: "Смирнова Елена Викторовна",
    reason: "Нарушение сроков доставки (ст. 23)",
    demand: "Возврат денежных средств",
    responsible: "Козлов Дмитрий Иванович",
    status: "В обработке"
  },
  {
    number: "24",
    date: "17.10.2023",
    seller: "ООО 'БытСервис'",
    consumer: "Алексеев Алексей Петрович",
    reason: "Некачественно оказанная услуга (ст. 31)",
    demand: "Устранение недостатков",
    responsible: "Петрова Мария Сергеевна",
    status: "В обработке"
  },
  {
    number: "31",
    date: "18.10.2023",
    seller: "ООО 'АвтоМир'",
    consumer: "Кузнецова Ольга Николаевна",
    reason: "Обнаружен скрытый недостаток товара",
    demand: "Возврат денежных средств",
    responsible: "Семенов Игорь Владимирович",
    status: "В обработке"
  },
  {
    number: "603",
    date: "19.10.2023",
    seller: "ИООО 'Дана Астра'",
    consumer: "Ягуберный Владимир Владимирович",
    reason: "Нарушение сроков гарантийного ремонта",
    demand: "Безвозмездное устранение недостатков",
    responsible: "Козлов Дмитрий Иванович",
    status: "В обработке"
  },
  {
    number: "461",
    date: "20.10.2023",
    seller: "ООО 'ТурПлюс'",
    consumer: "Семенова Елена Викторовна",
    reason: "Одностороннее изменение условий договора",
    demand: "Возмещение убытков",
    responsible: "Петрова Мария Сергеевна",
    status: "В обработке"
  },
  {
    number: "2462",
    date: "21.10.2023",
    seller: "ГП ЖЭУ №3",
    consumer: "Посудников Игорь Васильевич",
    reason: "Некачественные услуги ЖКХ",
    demand: "Перерасчет платежей",
    responsible: "Семенов Игорь Владимирович",
    status: "В обработке"
  },
  {
    number: "24312",
    date: "22.10.2023",
    seller: "ООО 'СтройГарант'",
    consumer: "Григорьев Артем Олегович",
    reason: "Нарушение сроков выполнения работ",
    demand: "Уменьшение цены договора",
    responsible: "Козлов Дмитрий Иванович",
    status: "Обработано"
  }
];


export const eventsData = [
  {
    number: 1,
    user_id: "user_123",
    id: "event_001",
    createdAt: "2023-05-15T10:30:00Z",
    type: "Судебное заседание",
    color: "#FF5733",
    date: "29.04.2025",
    time: "10:30",
    responsibleEmployee: "Иванов И.И.",
    court: "Арбитражный суд Москвы",
    case_num: 45678
  },
  {
    number: 2,
    user_id: "user_123",
    id: "event_002",
    createdAt: "2023-05-16T14:00:00Z",
    type: "Подача документов",
    color: "#33A1FF",
    date: "30.04.2025",
    time: "14:00",
    responsibleEmployee: "Петрова А.С.",
    court: "Мосгорсуд",
    case_num: 45679
  },
  {
    number: 3,
    user_id: "user_456",
    id: "event_003",
    createdAt: "2023-05-17T09:15:00Z",
    type: "Консультация",
    color: "#33FF57",
    date: "05.05.2025",
    time: "09:15",
    responsibleEmployee: null,
    court: null,
    case_num: null
  },
  {
    number: 4,
    user_id: "user_789",
    id: "event_004",
    createdAt: "2023-05-18T16:45:00Z",
    type: "Заседание",
    color: "#F033FF",
    date: "07.05.2025",
    time: "16:45",
    responsibleEmployee: "Сидоров В.В.",
    court: "Басманный суд",
    case_num: 45680
  },
  {
    number: 5,
    user_id: "user_123",
    id: "event_005",
    createdAt: "2023-05-19T11:20:00Z",
    type: "Получение решения",
    color: "#FF33A1",
    date: "12.05.2025",
    time: "11:20",
    responsibleEmployee: "Иванов И.И.",
    court: "Арбитражный суд Москвы",
    case_num: 45678
  }
];