export const financeData = [
  {
    date: "16.04.2025",
    payer:
      "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ \"ДЕВЕЛОПЕРСКАЯ КОМПАНИЯ 'ЭКИЛАТ'\"",
    unp: "193446670",
    amount: "1 100 руб. 0 коп.",
    purpose:
      "ВОЗМЕЩЕНИЕ РАСХОДОВ СОГЛАСНО МИРОВОМУ СОГЛАШЕНИЮ ОТ 20.03.2025 Г. ПО ГРАЖДАНСКОМУ ДЕЛУ 115ГПИ25531 СУДА МИНСКОГО РАЙОНА",
  },
  {
    date: "16.04.2025",
    payer: 'ЧАСТНОЕ ПРЕДПРИЯТИЕ "ДВЕРНОЙ ЛИДЕР"',
    unp: "691543753",
    amount: "500 руб. 0 коп.",
    purpose:
      "ВОЗМЕЩЕНИЕ РАСХОДОВ ОБЩЕСТВЕННОГО ОБЪЕДИНЕНИЯ, СВЯЗАННЫХ С ОБРАЩЕНИЕМ ПО ПОРУЧЕНИЮ ПОТРЕБИТЕЛЯ, СУША АНДРЕЯ СТАНИСЛАВОВИЧА, ПО СОГЛАШЕНИЮ ОБУРЕГУЛИРОВАНИИ СПОРА ОТ 16.04.2025Г. БЕЗ НДС",
    isFullfilled: false,
    caseNum: 145,
  },
  {
    isFullfilled: true,
    caseNum: 241,
    date: "15.04.2025",
    payer: 'ГОСУДАРСТВЕННОЕ ПРЕДПРИЯТИЕ "ЖЭУ №4 ЗАВОДСКОГО РАЙОНА Г.МИНСКА"',
    unp: "192589330",
    amount: "2 280 руб. 0 коп.",
    purpose:
      'РАСХОДЫ В СООТВЕТСТВИИ С ОПРЕДЕЛЕНИЕМ СУДА ЗАВОДСКОГО РАЙОНА Г. МИНСКА ОТ 26/02/2025Г ПО ИСКУ ОБЩЕСТВЕННОГО ОБЪЕДИНЕНИЯ "РЕГИОНАЛЬНОЕ ОБЩЕСТВО ЗАЩИТЫ ПРАВ ПОТРЕБИТЕЛЕЙ" В ИНТЕРЕСАХ ГУТКОВИЧА ЕВГЕНИЯ АЛЕКСАНДРОВИЧА К КУП "ЖЭУ 4 ЗАВОДСКОГО РАЙОНА Г.МИНСКА" О ЗАЩИТЕ ПРАВ ПОТРЕБИТЕЛЕЙ',
  },
  {
    isFullfilled: true,
    caseNum: 100,
    date: "15.04.2025",
    payer: 'Общество с ограниченной ответственностью "Тривиост"',
    unp: "190806803",
    amount: "816 руб. 4 коп.",
    purpose: "РАСХОДЫ ЗА ПРЕДСТАВЛЕНИЕ ИНТЕРЕСОВ ПРОСВИРЯЮКОВА А.В.",
  },
  {
    isFullfilled: false,
    caseNum: 300,
    date: "14.04.2025",
    payer: 'ЗАО "МТБанк"',
    unp: "100394906",
    amount: "101 руб. 76 коп.",
    purpose:
      "MP28 090401 Платеж Мой Банк, Возмещение расходов на проведение экспертизы по договору номер 202 от 11 04 25. Плательщик Жарикова Полина Сергеевна. Перевод не связан с предпринимательской деятельностью.",
  },
];
